---
kind: property
id: P:Autodesk.Revit.DB.ThermalAsset.Behavior
source: html/fc3ffbfe-232e-767e-8b1d-8c2f01d93c64.htm
---
# Autodesk.Revit.DB.ThermalAsset.Behavior Property

Flag indicating whether elements of this material behave isotropically or orthotropically.

## Syntax (C#)
```csharp
public StructuralBehavior Behavior { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration